EdgeTX/edgetx/radio/src/targets/common/arm/stm32/stm32_usart_driver.cpp
/*
 * Copyright (C) EdgeTX
 *
 * Based on code named
 *   opentx - https://github.com/opentx/opentx
 *   th9x - http://code.google.com/p/th9x
 *   er9x - http://code.google.com/p/er9x
 *   gruvin9x - http://code.google.com/p/gruvin9x
 *
 * License GPLv2: http://www.gnu.org/licenses/gpl-2.0.html
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#include "stm32_usart_driver.h"
#include "stm32_gpio.h"
#include "stm32_dma.h"
#include "hal/gpio.h"

#include "stm32_hal_ll.h"

#include <string.h>

#if defined(STM32H7) || defined(STM32H7RS)
  #define IS_HALF_DUPLEX(usart) ((usart)->set_input || (usart)->rxGPIO == GPIO_UNDEF)
#else
  #define IS_HALF_DUPLEX(usart) ((usart)->set_input)
#endif

// WARNING:
//
// NVIC_GetEnableIRQ is stolen from "${THIRDPARTY_DIR}/CMSIS/Include/core_cm4.h".
//
// Until we can include the new CMSIS everywhere, this
// needs to be defined here, as the old CMSIS does not define it.
//
// The new CMSIS can be used when StdPeriph is gone, as it mandates
// the old version located in "${STM32LIB_DIR}/CMSIS/Include"
//
#if !defined(NVIC_GetEnableIRQ)
static inline uint32_t NVIC_GetEnableIRQ(IRQn_Type IRQn)
{
  if ((int32_t)(IRQn) >= 0) {
    return ((uint32_t)(((NVIC->ISER[(((uint32_t)IRQn) >> 5UL)] &
                         (1UL << (((uint32_t)IRQn) & 0x1FUL))) != 0UL)
                           ? 1UL
                           : 0UL));
  } else {
    return (0U);
  }
}
#endif

static void _enable_usart_irq(const stm32_usart_t* usart)
{
  NVIC_SetPriority(usart->IRQn, usart->IRQ_Prio);
  NVIC_EnableIRQ(usart->IRQn);
}

static void _enable_tx_dma_irq(const stm32_usart_t* usart)
{
  NVIC_SetPriority(usart->txDMA_IRQn, usart->txDMA_IRQ_Prio);
  NVIC_EnableIRQ(usart->txDMA_IRQn);
}

static inline void _half_duplex_input(const stm32_usart_t* usart)
{
  if (usart->set_input) usart->set_input(true);

  if (IS_HALF_DUPLEX(usart)) {
    LL_USART_EnableDirectionRx(usart->USARTx);
  }
}

static inline void _half_duplex_output(const stm32_usart_t* usart)
{
  if (usart->set_input) usart->set_input(false);

  if (IS_HALF_DUPLEX(usart)) {
    LL_USART_DisableDirectionRx(usart->USARTx);
  }
}

void stm32_usart_enable_tx_irq(const stm32_usart_t* usart)
{
  if (LL_USART_IsEnabledDMAReq_TX(usart->USARTx)) {
    stm32_usart_wait_for_tx_dma(usart);
    LL_USART_DisableDMAReq_TX(usart->USARTx);
  }

  if (!NVIC_GetEnableIRQ(usart->IRQn)) {
    _enable_usart_irq(usart);
  }
  
  LL_USART_EnableIT_TXE(usart->USARTx);
}

void stm32_usart_set_idle_irq(const stm32_usart_t* usart, uint32_t enabled)
{
  if (enabled) {
    LL_USART_EnableIT_IDLE(usart->USARTx);
    _enable_usart_irq(usart);
  } else {
    LL_USART_DisableIT_IDLE(usart->USARTx);
    // Let's assume the port will be disabled soon
    // and we don't need to figure out whether or
    // not the IRQ needs to be disabled
  }
}

static void enable_usart_clock(USART_TypeDef* USARTx)
{
  if (USARTx == USART1) {
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);
  } else if (USARTx == USART2) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);
  } else if (USARTx == USART3) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);
  } else if (USARTx == UART4) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4);
  }
#if defined(UART5)
  else if (USARTx == UART5) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART5);
  }
#endif
#if defined(USART6)
  else if (USARTx == USART6) {
#if defined(LL_APB1_GRP1_PERIPH_USART6)
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART6);
#else
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART6);
#endif
  }
#endif
#if defined(UART7) // does not exist on F2
  else if (USARTx == UART7) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART7);
  }
#endif
#if defined(UART8)
  else if (USARTx == UART8) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART8);
  }
#endif
#if defined(UART9)
  else if (USARTx == UART9) {
    LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_UART9);
  }
#endif
#if defined(USART10)
  else if (USARTx == USART10) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART10);
  }
#endif
#if defined(USART11)
  else if (USARTx == USART11) {
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART11);
  }
#endif
#if defined(UART12)
  else if (USARTx == UART12) {
    LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_UART12);
  }
#endif
}

static void disable_usart_clock(USART_TypeDef* USARTx)
{
  if (USARTx == USART1) {
    LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART1);
  } else if (USARTx == USART2) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART2);
  } else if (USARTx == USART3) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART3);
  } else if (USARTx == UART4) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART4);
  }
#if defined(UART5)
  else if (USARTx == UART5) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART5);
  }
#endif
#if defined(USART6)
  else if (USARTx == USART6) {
#if defined(LL_APB1_GRP1_PERIPH_USART6)
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART6);
#else
    LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART6);
#endif
  }
#endif
#if defined(UART7) // does not exist on F2
  else if (USARTx == UART7) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART7);
  }
#endif
#if defined(UART8)
  else if (USARTx == UART8) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART8);
  }
#endif
#if defined(UART9)
  else if (USARTx == UART9) {
    LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_UART9);
  }
#endif
#if defined(USART10)
  else if (USARTx == USART10) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART10);
  }
#endif
#if defined(USART11)
  else if (USARTx == USART11) {
    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART11);
  }
#endif
#if defined(UART12)
  else if (USARTx == UART12) {
    LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_UART12);
  }
#endif


