EdgeTX/edgetx/radio/src/targets/common/arm/stm32/stm32_usart_driver.cpp
}

static gpio_speed_t _get_pin_speed(uint32_t baudrate)
{
  // 1 Mbps and above
  if (baudrate >= 1000000) {
    return GPIO_PIN_SPEED_VERY_HIGH;
  }
  // 400kbps and above
  else if (baudrate >= 400000) {
    return GPIO_PIN_SPEED_HIGH;
  }

  // under 400kbps
  return GPIO_PIN_SPEED_LOW;
}

#if defined(STM32H7RS)
# define _AF7_USART(x) \
  (x == USART1 || x == USART2 || x == USART3 || x == UART7)
#else // F2, F4
# define _AF7_USART(x) \
  (x == USART1 || x == USART2 || x == USART3)
#endif

static gpio_af_t _get_usart_af(gpio_t pin, USART_TypeDef* USARTx)
{
#if defined(STM32H7)
  GPIO_TypeDef* port = gpio_get_port(pin);
  uint32_t pinNr = gpio_get_pin(pin);
  if(USARTx == USART1)
  {
    if(port == GPIOA)
    {
      return GPIO_AF7;
    } else { // GPIOB
      if(pinNr < 14)
        return GPIO_AF7;
      return GPIO_AF4;
    }
  } else if (USARTx == USART2 || USARTx == USART3 || USARTx == USART6) {
    return GPIO_AF7;
  } else if (USARTx == UART4) {
    if(port == GPIOA && (pin == 11 || pin == 12))
        return GPIO_AF6;
    return GPIO_AF8;
  } else if (USARTx == UART5) {
    if(port == GPIOB)
      return GPIO_AF14;
    return GPIO_AF8;
  } else if (USARTx == UART7) {
    if (port == GPIOA || port == GPIOB)
      return GPIO_AF11;
    return GPIO_AF7;
  } else if (USARTx == UART8) {
    return GPIO_AF8;
  } else if (USARTx == USART10) {
    return GPIO_AF7;
  }
  return 0;
#elif defined(STM32H5)
   GPIO_TypeDef* port = gpio_get_port(pin);
   uint32_t pinNr = gpio_get_pin(pin);
   if(USARTx == USART1)
   {
     if(port == GPIOA)
     {
       return GPIO_AF7;
     } else { // GPIOB
       if(pinNr < 14)
         return GPIO_AF7;
       return GPIO_AF4;
     }
   } else if (USARTx == USART2 || USARTx == USART3 || USARTx == USART6) {
     return GPIO_AF7;
   } else if (USARTx == UART4) {
     if(port == GPIOA && (pin == 11 || pin == 12))
         return GPIO_AF6;
     return GPIO_AF8;
   } else if (USARTx == UART5) {
     if(port == GPIOB)
       return GPIO_AF14;
     return GPIO_AF8;
   } else if (USARTx == UART7) {
     if (port == GPIOA || port == GPIOB)
       return GPIO_AF11;
     return GPIO_AF7;
   } else if (USARTx == UART8) {
     if (port == GPIOH)
       return GPIO_AF7;
   } else if (USARTx == UART9) {
     return GPIO_AF11;
   } else if (USARTx == USART10) {
     if (port == GPIOG)
       return GPIO_AF6;
     return GPIO_AF7;
   } else if (USARTx == USART11) {
     return GPIO_AF7;
   } else if (USARTx == UART12) {
     if (port == GPIOE || port == GPIOF)
       return GPIO_AF6;
     return GPIO_AF7;
   }
   return 0;
#else
  return _AF7_USART(USARTx) ? GPIO_AF7 : GPIO_AF8;
#endif
}

// from stm32f4xx_ll_usart.c
static uint32_t _get_usart_periph_clock(USART_TypeDef* USARTx)
{
  uint32_t periphclk = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_RCC_ClocksTypeDef rcc_clocks;

  LL_RCC_GetSystemClocksFreq(&rcc_clocks);
  if (USARTx == USART1) {
    periphclk = rcc_clocks.PCLK2_Frequency;
  } else if (USARTx == USART2) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#if defined(USART3)
  else if (USARTx == USART3) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#endif /* USART3 */
#if defined(USART6)
  else if (USARTx == USART6) {
#if defined(STM32H5)
    periphclk = rcc_clocks.PCLK1_Frequency;
#else
    periphclk = rcc_clocks.PCLK2_Frequency;
#endif
  }
#endif /* USART6 */
#if defined(UART4)
  else if (USARTx == UART4) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#endif /* UART4 */
#if defined(UART5)
  else if (USARTx == UART5) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#endif /* UART5 */
#if defined(UART7)
  else if (USARTx == UART7) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#endif /* UART7 */
#if defined(UART8)
  else if (USARTx == UART8) {
    periphclk = rcc_clocks.PCLK1_Frequency;
  }
#endif /* UART8 */
#if defined(UART9)
  else if (USARTx == UART9) {
    periphclk = rcc_clocks.PCLK2_Frequency;
  }
#endif /* UART9 */
#if defined(USART10)
  else if (USARTx == USART10) {
    periphclk = rcc_clocks.PCLK2_Frequency;
  }
#endif /* USART10 */
#if defined(USART11)
  else if (USARTx == USART11) {
    periphclk = rcc_clocks.PCLK2_Frequency;
  }
#endif /* USART11 */
#if defined(UART12)
  else if (USARTx == UART12) {
    periphclk = rcc_clocks.PCLK2_Frequency;
  }
#endif /* USART12 */

  return periphclk;
}

static uint32_t _calc_best_oversampling(USART_TypeDef* USARTx, uint32_t baudrate)
{
  auto periphclk = _get_usart_periph_clock(USARTx);
  return (periphclk < (baudrate << 4)) ? LL_USART_OVERSAMPLING_8 : LL_USART_OVERSAMPLING_16;
}

void stm32_usart_init_rx_dma(const stm32_usart_t* usart, const void* buffer, uint32_t length)
{
  if (!usart->rxDMA) return;

  // Disable IRQ based RX
  LL_USART_DisableIT_RXNE(usart->USARTx);

  // In case TX DMA is used, IDLE IRQ is not, and not half-duplex,
  // disable the ISR completely
  if (usart->txDMA && !LL_USART_IsEnabledIT_IDLE(usart->USARTx) &&
      !IS_HALF_DUPLEX(usart)) {
    NVIC_DisableIRQ(usart->IRQn);
  }

  stm32_dma_enable_clock(usart->rxDMA);
  LL_DMA_DeInit(usart->rxDMA, usart->rxDMA_Stream);

  LL_DMA_InitTypeDef dmaInit;
  LL_DMA_StructInit(&dmaInit);

#if defined(STM32H7RS) || defined(STM32H5)
#if 0
    dmaInit.DestAddress = (intptr_t)buffer;
    dmaInit.SrcAddress =
        LL_USART_DMA_GetRegAddr(usart->USARTx, LL_USART_DMA_REG_DATA_RECEIVE);
    dmaInit.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    dmaInit.BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    dmaInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
    dmaInit.SrcBurstLength = 1;
    dmaInit.DestBurstLength = 1;
    dmaInit.SrcDataWidth = LL_DMA_SRC_DATAWIDTH_BYTE;
    dmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;
    dmaInit.SrcIncMode = LL_DMA_SRC_FIXED;
    dmaInit.DestIncMode = LL_DMA_DEST_INCREMENT;
    dmaInit.Priority = LL_DMA_HIGH_PRIORITY;
    dmaInit.BlkDataLength = length;
    dmaInit.TriggerMode = LL_DMA_TRIGM_BLK_TRANSFER;
    dmaInit.TriggerPolarity = LL_DMA_TRIG_POLARITY_MASKED;
    dmaInit.TriggerSelection = 0;
    dmaInit.Request = usart->rxDMA_Channel;
    dmaInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;
    dmaInit.SrcAllocatedPort = LL_DMA_SRC_ALLOCATED_PORT0;
    dmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOC   ATED_PORT0;
    dmaInit.LinkAllocatedPort = LL_DMA_LINK_ALLOCATED_PORT1;
    dmaInit.LinkStepMode = LL_DMA_LSM_FULL_EXECUTION;
    dmaInit.LinkedListBaseAddr = 0;
    dmaInit.LinkedListAddrOffset = 0;
    dmaInit.Mode = LL_DMA_NORMAL;
    LL_DMA_Init(usart->rxDMA, usart->rxDMA_Stream, &dmaInit);
#endif

    LL_DMA_InitNodeTypeDef nodeInit;
    LL_DMA_NodeStructInit(&nodeInit);

    nodeInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT1;
    nodeInit.DestHWordExchange = LL_DMA_DEST_HALFWORD_PRESERVE;
    nodeInit.DestByteExchange = LL_DMA_DEST_BYTE_PRESERVE;
    nodeInit.DestBurstLength = 1;
    nodeInit.DestIncMode = LL_DMA_DEST_INCREMENT;
    nodeInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;
    nodeInit.SrcAllocatedPort = LL_DMA_SRC_ALLOCATED_PORT0;
    nodeInit.SrcByteExchange = LL_DMA_SRC_BYTE_PRESERVE;
    nodeInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
    nodeInit.SrcBurstLength = 1;
    nodeInit.SrcIncMode = LL_DMA_SRC_FIXED;
    nodeInit.SrcDataWidth = LL_DMA_SRC_DATAWIDTH_BYTE;
    nodeInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;
    nodeInit.TriggerPolarity = LL_DMA_TRIG_POLARITY_MASKED;
    nodeInit.BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    nodeInit.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    nodeInit.Request = usart->rxDMA_Channel;
    nodeInit.UpdateRegisters = (LL_DMA_UPDATE_CTR1 | LL_DMA_UPDATE_CTR2 | LL_DMA_UPDATE_CBR1 | LL_DMA_UPDATE_CSAR
                                  | LL_DMA_UPDATE_CDAR | LL_DMA_UPDATE_CTR3 | LL_DMA_UPDATE_CBR2 | LL_DMA_UPDATE_CLLR);
    nodeInit.NodeType = LL_DMA_GPDMA_LINEAR_NODE;
    /* Additional settings */
    nodeInit.SrcAddress = LL_USART_DMA_GetRegAddr(usart->USARTx, LL_USART_DMA_REG_DATA_RECEIVE);
    nodeInit.DestAddress = (intptr_t)buffer;
    /* Size is always in bytes! Width is determined by source and destination numbers */
    nodeInit.BlkDataLength = length;
    LL_DMA_CreateLinkNode(&nodeInit, (LL_DMA_LinkNodeTypeDef*)&usart->llNode);

    /* Connect node to next node = to itself to achieve circular mode with one configuration */
    LL_DMA_ConnectLinkNode((LL_DMA_LinkNodeTypeDef*)&usart->llNode, LL_DMA_CLLR_OFFSET5, (LL_DMA_LinkNodeTypeDef*)&usart->llNode, LL_DMA_CLLR_OFFSET5);

