EdgeTX/edgetx/radio/src/targets/common/arm/stm32/stm32_usart_driver.cpp
    /*
     * Set first linked list address to DMA channel
     *
     * Set link update mechanism - DMA fetches first configuration from first node
     * on the start of DMA operation
     */
    LL_DMA_SetLinkedListBaseAddr(usart->rxDMA, usart->rxDMA_Stream, (intptr_t)&usart->llNode);
    LL_DMA_ConfigLinkUpdate(usart->rxDMA, usart->rxDMA_Stream,
                            (LL_DMA_UPDATE_CTR1 | LL_DMA_UPDATE_CTR2 | LL_DMA_UPDATE_CBR1 | LL_DMA_UPDATE_CSAR
                             | LL_DMA_UPDATE_CDAR | LL_DMA_UPDATE_CTR3 | LL_DMA_UPDATE_CBR2 | LL_DMA_UPDATE_CLLR),
                             (intptr_t)&usart->llNode);

    LL_DMA_InitLinkedListTypeDef DMA_InitLinkedListStruct = {0};
    /* Initialize linked list general setup for GPDMA CH0 - the way transfers are done */
    DMA_InitLinkedListStruct.Priority = LL_DMA_HIGH_PRIORITY;
    DMA_InitLinkedListStruct.LinkStepMode = LL_DMA_LSM_FULL_EXECUTION;
    DMA_InitLinkedListStruct.LinkAllocatedPort = LL_DMA_LINK_ALLOCATED_PORT0;
    DMA_InitLinkedListStruct.TransferEventMode = LL_DMA_TCEM_LAST_LLITEM_TRANSFER;
    LL_DMA_List_Init(usart->rxDMA, usart->rxDMA_Stream, &DMA_InitLinkedListStruct);


    LL_DMA_EnableIT_HT(usart->rxDMA, usart->rxDMA_Stream);
    LL_DMA_EnableIT_TC(usart->rxDMA, usart->rxDMA_Stream);
    LL_DMA_EnableIT_USE(usart->rxDMA, usart->rxDMA_Stream);
    LL_DMA_EnableIT_ULE(usart->rxDMA, usart->rxDMA_Stream);
    LL_DMA_EnableIT_DTE(usart->rxDMA, usart->rxDMA_Stream);

    LL_USART_EnableDMAReq_RX(usart->USARTx);

#else // STM32H7RS

#if defined(STM32H7)
  dmaInit.PeriphRequest = usart->rxDMA_Channel;
#else
  dmaInit.Channel = usart->rxDMA_Channel;
#endif

#if defined(LL_USART_DMA_REG_DATA_RECEIVE)
  dmaInit.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(usart->USARTx, LL_USART_DMA_REG_DATA_RECEIVE);
#else
  dmaInit.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(usart->USARTx);
#endif
  dmaInit.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
  dmaInit.MemoryOrM2MDstAddress = (uint32_t)buffer;
  dmaInit.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
  dmaInit.Mode = LL_DMA_MODE_CIRCULAR;
  dmaInit.NbData = length;
  dmaInit.Priority = LL_DMA_PRIORITY_LOW; // TODO: make it configurable
  LL_DMA_Init(usart->rxDMA, usart->rxDMA_Stream, &dmaInit);
  LL_USART_EnableDMAReq_RX(usart->USARTx);

#endif // !STM32H7RS

  // Stream can be enable as the USART has already been enabled
#if defined(STM32H7RS) || defined(STM32H5)
  LL_DMA_EnableChannel(usart->rxDMA, usart->rxDMA_Stream);
  // The USART RX was enabled before the DMA channel above; bytes arriving in
  // that window can latch ORE and lock the receiver. Clear any RX error flags
  // now so the freshly-armed DMA starts cleanly.
  WRITE_REG(usart->USARTx->ICR, USART_ICR_ORECF | USART_ICR_NECF |
                                    USART_ICR_FECF | USART_ICR_PECF);
#else
  LL_DMA_EnableStream(usart->rxDMA, usart->rxDMA_Stream);
#endif
}

void stm32_usart_deinit_rx_dma(const stm32_usart_t* usart)
{
  if (!usart->rxDMA) return;

  LL_DMA_DeInit(usart->rxDMA, usart->rxDMA_Stream);

  if ((int32_t)(usart->IRQn) >= 0) {

    // Enable IRQ based RX
    LL_USART_EnableIT_RXNE(usart->USARTx);
    _enable_usart_irq(usart);
  }
}

#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
void stm32_usart_rx_inversion(const stm32_usart_t* usart, bool on)
{
  bool enableUart = false;
  if (LL_USART_IsEnabled(usart->USARTx)) {
    LL_USART_Disable(usart->USARTx);
    enableUart = true;
  }
  LL_USART_SetRXPinLevel(usart->USARTx, on ? LL_USART_RXPIN_LEVEL_INVERTED
                                           : LL_USART_RXPIN_LEVEL_STANDARD);
  if (enableUart) LL_USART_Enable(usart->USARTx);
}

void stm32_usart_tx_inversion(const stm32_usart_t* usart, bool on)
{
  bool enableUart = false;
  if (LL_USART_IsEnabled(usart->USARTx)) {
    LL_USART_Disable(usart->USARTx);
    enableUart = true;
  }
  LL_USART_SetTXPinLevel(usart->USARTx, on ? LL_USART_TXPIN_LEVEL_INVERTED
                                           : LL_USART_TXPIN_LEVEL_STANDARD);
  if (enableUart) LL_USART_Enable(usart->USARTx);
}
#endif

// TODO: probably needs to be a separate API on the serial driver
//
// - USART_OneBitMethodCmd(TELEMETRY_USART, ENABLE);

// OBSOLETE:
// - asymmetric bitrates for half-duplex (GHOST)
// - ??? ability to switch RX DMA OFF ??? (-> X12S)
//
bool stm32_usart_init(const stm32_usart_t* usart, const etx_serial_init* params)
{
  // Test if the GPIO pins are in reset state
  // if (((usart->txGPIO != GPIO_UNDEF) &&
  //      (gpio_get_mode(usart->txGPIO) != GPIO_IN)) ||
  //     ((usart->rxGPIO != GPIO_UNDEF) &&
  //      (gpio_get_mode(usart->rxGPIO) != GPIO_IN))) {
  //   return false;
  // }

  enable_usart_clock(usart->USARTx);
  LL_USART_DeInit(usart->USARTx);

  if (usart->rxGPIO != GPIO_UNDEF) {
    gpio_af_t af = _get_usart_af(usart->rxGPIO, usart->USARTx);
    gpio_init_af(usart->rxGPIO, af, _get_pin_speed(params->baudrate));
  }
  if (usart->txGPIO != GPIO_UNDEF) {
    gpio_af_t af = _get_usart_af(usart->txGPIO, usart->USARTx);
    gpio_init_af(usart->txGPIO, af, _get_pin_speed(params->baudrate));
  }
  
  bool half_duplex = usart->set_input;

#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
  bool one_wire_half_duplex =
      usart->rxGPIO == GPIO_UNDEF && (params->direction & ETX_Dir_RX);

  if (one_wire_half_duplex) {
    if (params->direction & ETX_Dir_TX) {
      LL_GPIO_SetPinPull(
          gpio_get_port(usart->txGPIO), 1 << gpio_get_pin(usart->txGPIO),
          params->polarity ? LL_GPIO_PULL_UP : LL_GPIO_PULL_DOWN);
    }
    LL_USART_ConfigHalfDuplexMode(usart->USARTx);
  }

  half_duplex = half_duplex || one_wire_half_duplex;
#endif

  LL_USART_InitTypeDef usartInit;
  LL_USART_StructInit(&usartInit);

  usartInit.OverSampling = _calc_best_oversampling(usart->USARTx, params->baudrate);
  usartInit.BaudRate = params->baudrate;
  usartInit.Parity = LL_USART_PARITY_NONE;
  usartInit.DataWidth = LL_USART_DATAWIDTH_8B;

  switch(params->encoding){

  case ETX_Encoding_8E2:
    usartInit.Parity = LL_USART_PARITY_EVEN;
    usartInit.StopBits = LL_USART_STOPBITS_2;
    usartInit.DataWidth = LL_USART_DATAWIDTH_9B;
    break;

