EdgeTX/edgetx/radio/src/targets/common/arm/stm32/stm32_usart_driver.cpp
  case ETX_Encoding_8N1:
    break;

  default:
    stm32_usart_deinit(usart);
    return false;
  }

  usartInit.HardwareFlowControl = LL_USART_HWCONTROL_NONE;

  usartInit.TransferDirection = LL_USART_DIRECTION_NONE;

  if (params->direction & ETX_Dir_RX)
    usartInit.TransferDirection |= LL_USART_DIRECTION_RX;

  if (params->direction & ETX_Dir_TX)
    usartInit.TransferDirection |= LL_USART_DIRECTION_TX;


  LL_USART_Init(usart->USARTx, &usartInit);
  LL_USART_Enable(usart->USARTx);

  if (params->direction & ETX_Dir_TX) {
    // Enable TX DMA request
    if (usart->txDMA) {
      LL_USART_EnableDMAReq_TX(usart->USARTx);

      // 2-wire half-duplex: setup TX DMA IRQ
      if (half_duplex && (int32_t)(usart->txDMA_IRQn) >= 0) {
        _enable_tx_dma_irq(usart);
      }
    }
  }

  if (params->direction & ETX_Dir_RX) {
    // IRQ based RX
    if ((int32_t)(usart->IRQn) >= 0) {
      LL_USART_EnableIT_RXNE(usart->USARTx);
    }

    // half-duplex: start in input mode
    if (half_duplex) {
      _half_duplex_input(usart);
    }
  }

  if (((params->direction & ETX_Dir_TX) && !usart->txDMA) ||
      LL_USART_IsEnabledIT_RXNE(usart->USARTx)) {
    _enable_usart_irq(usart);
  }

  return true;
}

void stm32_usart_deinit(const stm32_usart_t* usart)
{
  if (usart->rxDMA) {
    LL_DMA_DeInit(usart->rxDMA, usart->rxDMA_Stream);
  }
  if (usart->txDMA) {
    LL_DMA_DeInit(usart->txDMA, usart->txDMA_Stream);
  }

  if ((int32_t)(usart->IRQn) >= 0) {
    // An IRQ latched before (or in flight across) NVIC_DisableIRQ() would
    // still be taken, and would then access a de-initialised, clock-gated
    // peripheral. Barrier + clear pending closes that window.
    NVIC_DisableIRQ(usart->IRQn);
    __DSB();
    __ISB();
    NVIC_ClearPendingIRQ(usart->IRQn);
  }
  LL_USART_DeInit(usart->USARTx);
  disable_usart_clock(usart->USARTx);

  // Reconfigure pin as input
  if (usart->rxGPIO != GPIO_UNDEF) {
    gpio_init(usart->rxGPIO, GPIO_IN, GPIO_PIN_SPEED_LOW);
  }
  if (usart->txGPIO != GPIO_UNDEF) {
    gpio_init(usart->txGPIO, GPIO_IN, GPIO_PIN_SPEED_LOW);
  }
}

void stm32_usart_send_byte(const stm32_usart_t* usart, uint8_t byte)
{
  // TODO: split into 2 steps to avoid blocking on send
  while (!LL_USART_IsActiveFlag_TXE(usart->USARTx));

  if (IS_HALF_DUPLEX(usart)) {
    _half_duplex_output(usart);

    // switch back to input after TC
    LL_USART_ClearFlag_TC(usart->USARTx);
    LL_USART_EnableIT_TC(usart->USARTx);
  }

  LL_USART_TransmitData8(usart->USARTx, byte);
}

void stm32_usart_send_buffer(const stm32_usart_t* usart, const uint8_t * data, uint32_t size)
{

  if (!stm32_usart_tx_completed(usart)) {
    // Transmission is already in progress, abort
    return;
  }

  _half_duplex_output(usart);

  if (usart->txDMA) {
    stm32_dma_enable_clock(usart->txDMA);
    LL_DMA_DeInit(usart->txDMA, usart->txDMA_Stream);

    LL_DMA_InitTypeDef dmaInit;
    LL_DMA_StructInit(&dmaInit);
#if defined(STM32H7RS) || defined(STM32H5)
    dmaInit.DestAddress =
        LL_USART_DMA_GetRegAddr(usart->USARTx, LL_USART_DMA_REG_DATA_TRANSMIT);
    dmaInit.SrcAddress = (intptr_t)data;
    dmaInit.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    dmaInit.BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    dmaInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
    dmaInit.SrcBurstLength = 1;
    dmaInit.DestBurstLength = 1;
    dmaInit.SrcDataWidth = LL_DMA_SRC_DATAWIDTH_BYTE;
    dmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;
    dmaInit.SrcIncMode = LL_DMA_SRC_INCREMENT;
    dmaInit.DestIncMode = LL_DMA_DEST_FIXED;
    dmaInit.Priority = LL_DMA_LOW_PRIORITY_HIGH_WEIGHT;
    dmaInit.BlkDataLength = size;
    dmaInit.TriggerMode = LL_DMA_TRIGM_BLK_TRANSFER;
    dmaInit.TriggerPolarity = LL_DMA_TRIG_POLARITY_MASKED;
    dmaInit.TriggerSelection = 0;
    dmaInit.Request = usart->txDMA_Channel;
    dmaInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;
    dmaInit.SrcAllocatedPort = LL_DMA_SRC_ALLOCATED_PORT0;
    dmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT0;
    dmaInit.LinkAllocatedPort = LL_DMA_LINK_ALLOCATED_PORT1;
    dmaInit.LinkStepMode = LL_DMA_LSM_FULL_EXECUTION;
    dmaInit.LinkedListBaseAddr = 0;
    dmaInit.LinkedListAddrOffset = 0;
    dmaInit.Mode = LL_DMA_NORMAL;

    LL_DMA_Init(usart->txDMA, usart->txDMA_Stream, &dmaInit);

    LL_DMA_EnableIT_TC(usart->txDMA, usart->txDMA_Stream);
    LL_DMA_EnableIT_USE(usart->txDMA, usart->txDMA_Stream);
    LL_DMA_EnableIT_ULE(usart->txDMA, usart->txDMA_Stream);
    LL_DMA_EnableIT_DTE(usart->txDMA, usart->txDMA_Stream);

    LL_USART_EnableDMAReq_TX(usart->USARTx);
    LL_DMA_EnableChannel(usart->txDMA, usart->txDMA_Stream);


#else

#if defined(STM32H7)
    dmaInit.PeriphRequest = usart->txDMA_Channel;
#else
    dmaInit.Channel = usart->txDMA_Channel;
#endif

#if defined(LL_USART_DMA_REG_DATA_RECEIVE)
    dmaInit.PeriphOrM2MSrcAddress =
        LL_USART_DMA_GetRegAddr(usart->USARTx, LL_USART_DMA_REG_DATA_TRANSMIT);
#else
    dmaInit.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(usart->USARTx);
#endif

    dmaInit.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    dmaInit.MemoryOrM2MDstAddress = (uint32_t)data;
    dmaInit.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    dmaInit.NbData = size;
    dmaInit.Priority = LL_DMA_PRIORITY_VERYHIGH;  // TODO: make it configurable

    // Prefetch the frame into the DMA FIFO instead of fetching one byte per
    // USART request (direct mode), so bus contention from another stream on the
    // same controller (e.g. SDIO) cannot starve a byte and corrupt the frame.
    dmaInit.FIFOMode = LL_DMA_FIFOMODE_ENABLE;
    dmaInit.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_FULL;

    LL_DMA_Init(usart->txDMA, usart->txDMA_Stream, &dmaInit);

    if (IS_HALF_DUPLEX(usart) && (int32_t)(usart->txDMA_IRQn) >= 0) {
      LL_DMA_EnableIT_TC(usart->txDMA, usart->txDMA_Stream);
      LL_USART_ClearFlag_TC(usart->USARTx);
    }
    LL_DMA_EnableStream(usart->txDMA, usart->txDMA_Stream);
#endif // !STM32H7RS

    return;
  } else {
    // Please note that we don't use the buffer:
    // it should be set internally by the driver user
    // and each byte is returned individually by on_send()
    if ((int32_t)(usart->IRQn) >= 0) LL_USART_EnableIT_TXE(usart->USARTx);
  }
}

