EdgeTX/edgetx/radio/src/targets/common/arm/stm32/stm32_usart_driver.cpp
uint8_t stm32_usart_tx_completed(const stm32_usart_t* usart)
{
  if (LL_USART_IsEnabledDMAReq_TX(usart->USARTx)) {
#if defined(STM32H7RS) || defined(STM32H5)
    // TX DMA is configured, let's check if the stream is currently enabled
    if (LL_DMA_IsEnabledChannel(usart->txDMA, usart->txDMA_Stream) ||
        !LL_USART_IsActiveFlag_TXE(usart->USARTx))
      return 0;
#else
    // TX DMA is configured, let's check if the stream is currently enabled
    if (LL_DMA_IsEnabledStream(usart->txDMA, usart->txDMA_Stream) ||
        !LL_USART_IsActiveFlag_TXE(usart->USARTx))
      return 0;
#endif
  } else if (LL_USART_IsEnabledIT_TXE(usart->USARTx)) {
    return 0;
  }

  return LL_USART_IsActiveFlag_TXE(usart->USARTx);
}

void stm32_usart_wait_for_tx_dma(const stm32_usart_t* usart)
{
  // TODO: check if everything is properly initialised, this seems to block when
  //       the port has been initialised with a zero baudrate
#if !defined(STM32H7RS) && !defined(STM32H5)
  if (LL_DMA_IsEnabledStream(usart->txDMA, usart->txDMA_Stream)) {

    switch(usart->txDMA_Stream) {
    case LL_DMA_STREAM_0:
      while (!LL_DMA_IsActiveFlag_TC0(usart->txDMA));
      LL_DMA_ClearFlag_TC0(usart->txDMA);
      break;
    case LL_DMA_STREAM_1:
      while (!LL_DMA_IsActiveFlag_TC1(usart->txDMA));
      LL_DMA_ClearFlag_TC1(usart->txDMA);
      break;
    case LL_DMA_STREAM_2:
      while (!LL_DMA_IsActiveFlag_TC2(usart->txDMA));
      LL_DMA_ClearFlag_TC2(usart->txDMA);
      break;
    case LL_DMA_STREAM_3:
      while (!LL_DMA_IsActiveFlag_TC3(usart->txDMA));
      LL_DMA_ClearFlag_TC3(usart->txDMA);
      break;
    case LL_DMA_STREAM_4:
      while (!LL_DMA_IsActiveFlag_TC4(usart->txDMA));
      LL_DMA_ClearFlag_TC4(usart->txDMA);
      break;
    case LL_DMA_STREAM_5:
      while (!LL_DMA_IsActiveFlag_TC5(usart->txDMA));
      LL_DMA_ClearFlag_TC5(usart->txDMA);
      break;
    case LL_DMA_STREAM_6:
      while (!LL_DMA_IsActiveFlag_TC6(usart->txDMA));
      LL_DMA_ClearFlag_TC6(usart->txDMA);
      break;
    case LL_DMA_STREAM_7:
      while (!LL_DMA_IsActiveFlag_TC7(usart->txDMA));
      LL_DMA_ClearFlag_TC7(usart->txDMA);
      break;
    }
  }
#else
  while(LL_DMA_IsEnabledChannel(usart->txDMA, usart->txDMA_Stream)); // is this correct?
  LL_DMA_ClearFlag_TC(usart->txDMA, usart->txDMA_Stream);
#endif
}

void stm32_usart_enable_rx(const stm32_usart_t* usart)
{
  _half_duplex_input(usart);
}

uint32_t stm32_usart_get_baudrate(const stm32_usart_t* usart)
{
  auto periphclk = _get_usart_periph_clock(usart->USARTx);
  auto oversampling = LL_USART_GetOverSampling(usart->USARTx);
#if defined(LL_USART_PRESCALER_DIV1)
  return LL_USART_GetBaudRate(usart->USARTx, periphclk, LL_USART_PRESCALER_DIV1, oversampling);
#else
  return LL_USART_GetBaudRate(usart->USARTx, periphclk, oversampling);
#endif
}

void stm32_usart_set_baudrate(const stm32_usart_t* usart, uint32_t baudrate)
{
  auto periphclk = _get_usart_periph_clock(usart->USARTx);
  auto oversampling = _calc_best_oversampling(usart->USARTx, baudrate);
  LL_USART_SetOverSampling(usart->USARTx, oversampling);    
#if defined(LL_USART_PRESCALER_DIV1)
  LL_USART_SetBaudRate(usart->USARTx, periphclk, LL_USART_PRESCALER_DIV1, oversampling, baudrate);
#else
  LL_USART_SetBaudRate(usart->USARTx, periphclk, oversampling, baudrate);
#endif
}

void stm32_usart_set_hw_option(const stm32_usart_t* usart, uint32_t option)
{
  switch(option) {
  case ETX_HWOption_ONEBIT:
    LL_USART_EnableOneBitSamp(usart->USARTx);
    break;
  }
}

#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
# define USART_STATUS_REG ISR
# define USART_IDLE USART_ISR_IDLE
# define USART_TXE USART_ISR_TXE_TXFNF
# define USART_TC USART_ISR_TC
# define USART_RXNE USART_ISR_RXNE_RXFNE
# define USART_FLAG_ERRORS \
  (USART_ISR_ORE | USART_ISR_NE | USART_ISR_FE | USART_ISR_PE)
#else
# define USART_STATUS_REG SR
# define USART_IDLE USART_SR_IDLE
# define USART_TXE USART_SR_TXE
# define USART_TC USART_SR_TC
# define USART_RXNE USART_SR_RXNE
# define USART_FLAG_ERRORS \
  (USART_SR_ORE | USART_SR_NE | USART_SR_FE | USART_SR_PE)
#endif

void stm32_usart_isr(const stm32_usart_t* usart, etx_serial_callbacks_t* cb)
{
  uint32_t status = LL_USART_ReadReg(usart->USARTx, USART_STATUS_REG);

  // cache these first, as RXNE might clear ISR
  uint32_t idle = (status & USART_IDLE);
  uint32_t txe = (status & USART_TXE);

  // TC is only enabled with 2-wire half-duplex when TX DMA was in use
  if (LL_USART_IsEnabledIT_TC(usart->USARTx) && (status & USART_TC)) {

    // disable TC IRQ
    LL_USART_DisableIT_TC(usart->USARTx);

    // switch to input
    _half_duplex_input(usart);

    // and drain RX side first
    while (status & USART_RXNE) {
      status = LL_USART_ReceiveData8(usart->USARTx);
      status = LL_USART_ReadReg(usart->USARTx, USART_STATUS_REG);
    }
  }
  
  // Receive: do it first as it is more time critical
  if (LL_USART_IsEnabledIT_RXNE(usart->USARTx)) {

    // Drain RX
    while (status & (USART_RXNE | USART_FLAG_ERRORS)) {

      // This will clear the RXNE/error bits in USART_SR register
      uint8_t data = LL_USART_ReceiveData8(usart->USARTx);

      if (status & USART_FLAG_ERRORS) {
#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
        WRITE_REG(usart->USARTx->ICR, status & USART_FLAG_ERRORS);
#endif
        if (cb->on_error)
          cb->on_error();
      }

      if (status & USART_RXNE) {
        if (cb->on_receive)
          cb->on_receive(data);
      }

      status = LL_USART_ReadReg(usart->USARTx, USART_STATUS_REG);
    }
  }

  // IRQ based send: TXE IRQ is enabled only during transfer
  if (LL_USART_IsEnabledIT_TXE(usart->USARTx) && txe) {

    uint8_t data;
    if (cb->on_send && cb->on_send(&data)) {
      LL_USART_TransmitData8(usart->USARTx, data);
    } else {
      LL_USART_DisableIT_TXE(usart->USARTx);
    }
  }

  if (LL_USART_IsEnabledIT_IDLE(usart->USARTx) && idle) {
    // ISR clear sequence
    status = LL_USART_ReceiveData8(usart->USARTx);
    LL_USART_ClearFlag_IDLE(usart->USARTx);
#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
    // With DMA RX the RXNE/error handler above is skipped (RXNE IT disabled),
    // so RX error flags are never acknowledged there. A latched ORE locks the
    // receiver permanently; clear any pending RX errors here so reception
    // recovers (notably after the startup race before the DMA channel is on).
    uint32_t rx_errs =
        LL_USART_ReadReg(usart->USARTx, USART_STATUS_REG) & USART_FLAG_ERRORS;
    if (rx_errs) {
      WRITE_REG(usart->USARTx->ICR, rx_errs);
      if (cb->on_error) cb->on_error();
    }
#endif
    if (cb->on_idle) cb->on_idle(cb->on_idle_ctx);
  }
}

void stm32_usart_tx_dma_isr(const stm32_usart_t* usart)
{
  if (!stm32_dma_check_tc_flag(usart->txDMA, usart->txDMA_Stream))
    return;

  auto USARTx = usart->USARTx;
  LL_USART_EnableIT_TC(USARTx);
}
